import { Title } from '@/components/shared/Title';
import { Accordion } from '@/components/shared/services/Accordion';

export interface ServiceProps {
  title: string;
  content: string;
}

const services: ServiceProps[] = [
  {
    title: 'Цвяхотерапія',
    content:
      'Ми працюємо з вашим запитом, обговорюємо його, шукаємо корінь проблеми і відповідно працюємо з ним, щоб ефективно і правильно його вирішити. За потреби використовую МАК-карти, щоб побачити проблему зі сторони підсвідомості. /paragraph/ Після чого, я пояснюю Вам, як правильно встати на дошку Садху, яка реакція буде в організмі, що означає саботаж мозку, як з ним працювати, про перші хвилини болю і  відповідаю на Ваші питання стосовно всього процесу. /row/ За потреби погружаємося в медитацію для розслаблення. /paragraph/ Після успішного подолання больового порогу, ми йдемо в терапію. Я ставлю питання, стосовно вашої проблеми, ми відслідковуємо реакцію тіла, які ділянки дають про себе знати, на що звернути увагу і що це означає, окрім цього, звертаємо увагу і розбираємо Ваші думки - чому саме про це Ви почали думати. /paragraph/ Під час стояння підсвідомість буде видавати і пригадувати певні ситуації, які дуже важливі в вашому житті, а по тій чи іншій причині Ви блокуєте цей спогад - звертаємо увагу і працюємо з цим. /paragraph/ Коли Ви відчуваєте, що готові завершити практику, інформуєте і ми сідаємо (цілий час я з Вами поруч, тримаю Вас за руки) /row/ Після цього ми обговорюємо Ваші почуття, емоції, враження, який досвід отримали, що усвідомили, що винесли для себе. /row/ За потреби закріплюємо результат МАК-картами. /paragraph/ Вартість - 299 PLN. /row/ Тривалість - 2 години.',
  },
  {
    title: 'Розбір Матриці Долі під запит',
    content:
      'Це чудовий метод самопізнання, який побудований на розборі вашої дати народження і створений за допомогою старших Арканів Таро. Засновниця цього методу - Наталія Ладіні. /paragraph/ /paint/Працюємо з вашим запитом - це важливо! Цілий розбір Матриці розкладається на декілька зустрічей! (описаний нижче)/paint/ /paragraph/ Формат 1: /row/ Ви озвучуєте проблему або сферу яка Вас цікавить. /row/ За допомогою вашої дати народження, я можу розібрати такі сфери як: фінанси, відносини, карма, таланти, карма роду, матеріальна карма, візитка (як вас бачать інші люди). /paragraph/ Після консультації Ви отримаєте також розбір в текстовому форматі, де пізніше можете ще раз все прочитати і задати питання, якщо буде щось не зрозуміло. /row/ Тривалість - до 2х годин. /row/ Вартість - 199 PLN /paragraph/  Формат 2: /row/ Все так само, як і в першому форматі, але замість прямої консультації зі мною, я створюю приватний телеграм канал і описую Ваш запит голосовими повідомленнями, також додаю текстовий формат. /row/ Вартість - 149 PLN.',
  },
  {
    title: 'Матриця Сумісності',
    content:
      'Це чудовий спосіб дізнатися сумісність з Вашим партнером, вивести відносини на новий рівень, та пропрацювати проблеми і задачі пари. /paragraph/ Розбір вашої пари відразу йде цілий. Я розглядаю всі зони, які є у вашій Матриці, а саме - задача пари, карма, натхнення, матеріальні і духовні задачі, через що пара може розійтися, як вести бюджет, що саме важливе у стосунках, як покращити їх та знайти гармонію, спільні інтереси, заняття, як залагоджувати конфлікти, проблеми і складнощі з якими можете зіткнутися, як вас бачать інші, призначення пари. /paragraph/ Формат: телеграм канал з голосовими повідомленнями. /row/ Вартість - 199 PLN.',
  },
  {
    title: 'Розбір цілої Матриці Долі',
    content:
      'Цей формат розкладається на декілька зустрічей. По порядку обговорюємо кожну зону, з чого варто почати пропрацювання, на що звернути увагу, як поєднати всі енергії. /row/ Допомагаю в пропрацюванні проблем, з виведенням енергії в плюс, даю додаткові матеріали (медитації, практики). /row/ Якщо формат offline зустрічі в Познані - додаємо цвяхи в пропрацювання енергій, блоків, проблеми (за бажанням). /paragraph/ В подарунок роблю прогноз на рік. /row/ Тривалість - 1,5 місяців. /row/ Вартість - 499 PLN, з цвяхами - 649 PLN.',
  },
  {
    title: 'Матриця Долі дитини',
    content:
      'Це чудова можливість зробити розбір для своєї дитини. Дізнатися її призначення, таланти, сильні та слабкі сторони, на що звернути увагу при вихованні, як правильно пропрацювати карму. Яку професію обрати, щоб була по душі і приносила найбільший дохід в майбутньому. /paragraph/ Розбір дитячої Матриці проводиться під запит, що найбільше цікавить і хочеться дізнатися про свою дитину. /paragraph/ Тривалість - до 2х годин (якщо формат консультації). /row/ Вартість - 199 PLN. /row/ Формат телеграм каналу - 149 PLN.',
  },
  {
    title: 'Карта здоров’я',
    content:
      'Розбір ваших чакр. Їх всього в нас 7. Кожна чакра складається з 3х енергій, які беруться з Матриці Долі. /paragraph/ За що вони відповідають: /row/ - Чарка Мулатхара (ноги, анус, крижова кістка і сечостатева система); /row/ - Чакра Свадхістана (нирки, товста кишка, наднирники, полові органи); /row/ - Чакра Маніпура (хребет, ЖКТ, печінка); /row/ - Чакра Анахата (серце, легені, бронхи, ребра і грудна клітка); /row/ - Чакра Вішудха (горло, нижня щелепа, щитовидна залоза, плечі і руки); /row/ - Чакра Аджна (очі, вуха, обличчя, щитовидна залоза, плечі і руки); /row/ - Чакра Сахасрара (волосся, мозок, верхня частина черепа); /row/ І загальне енергополе - це лімфатична і кровоносна система, а також зайва вага. /paragraph/ Формат карти здоровʼя - телеграм канал /row/ Вартість - ціла карта 99 PLN, декілька чакр - від 49 PLN.',
  },
  {
    title: 'Прогнозування',
    content:
      'Поглиблений прогноз на рік з рекомендаціями, як прожити його згідно з вашими енергіями. Пояснюю чому рік проходитиме по плюсу, а чому по мінусу, до чого потрібно прийти в цьому році, яка головна ціль року. /row/ Розписую також кожен місяць під якою енергією пройде і рекомендації до них. /paragraph/ Прогноз на рік краще замовляти перед днем народження! /paragraph/ Прогноз на місяць - даю опис місяця і рекомендації, як прожити по плюсу. Також пояснюю чому може відіграватися в мінусі. /paragraph/ Формат - тільки текстовий варіант. /row/ Вартість поглибленого прогнозу на рік - 199 PLN /row/ Прогноз на місяць - 39 PLN.',
  },
  {
    title: 'Призначення Душі',
    content:
      'Ваша найголовніша задача у цьому втілені, для чого ваша душа обрала Вас, для якої місії. Призначення дає можливість встати на свій шлях і жити в гармонії та балансі з собою та Всесвітом /paragraph/ Існує в нас всього 4 призначення: Для себе, Соціальне, Загальне, Планетарне. /row/ Пропрацювання кожного дає свої бонуси в майбутньому. У певні періоди життя важливо виконувати приділену для цього задачу. /paragraph/ Формат - телеграм канал. /row/ Вартість - 79 PLN.',
  },
  {
    title: 'МАК-карти',
    content:
      'Мак-карти - це метафоричні асоціаційні картки, які використовуються для отримання інсайтів та розкриття інформації, що може бути прихованою в підсвідомості. Кожна карта має власне зображення або символіку, яка може сприйматися різними людьми по-різному. Вони можуть представляти різні аспекти особистості, емоції, стани душі, життєві ситуації тощо. /paragraph/ У консультаціях мак-карти використовуються для того, щоб допомогти виявити та вирішити певні проблеми, розкрити та проаналізувати свої переживання та думки. Вони можуть стимулювати творчість, сприяти самовираженню та сприйняттю внутрішнього світу. /paragraph/ Під час сесії мак-карти можуть використовуватися як засіб для запитань, рефлексії, аналізу ситуацій або просто для відкриття нових шляхів мислення та розуміння. Вони допомагають поглибити терапевтичний процес, дозволяючи клієнту краще зрозуміти свої внутрішні переживання та знайти способи їх вирішення. /paragraph/ Такий метод доповнює основні терапевтичні техніки, дозволяючи включити в процес роботи елементи творчості, самовираження та глибокого розуміння.',
  },
];

export const Services = () => {
  return (
    <section className="flex flex-col gap-y-8" id="services">
      <Title>Мої послуги</Title>
      <div className="">
        <Accordion services={services} />
      </div>
    </section>
  );
};
