import { Title } from '@/components/shared/Title';
import { FeedbackSlider } from '@/components/shared/feedback/FeedbackSlider';
import FeedbackVideo from '@/components/shared/feedback/FeedbackVideo/FeedbackVideo';

const data = [
  {
    category: 'Матриця Долі',
    feedback:
      'Юля, добрий вечір! Я нарешті можу написати свій відгук про ваш неймовірний розклад. Таке відчуття наче Ви мене знаєте не один рік. Як багато всього так і є. Кожен аркан в більшості працює на мене в плюсі, так, звичайно є якісь мінуси, я не виключаю цього, але я тепер я, завдяки Вам, маю, як то кажуть, інструкцію для свого правильного життя. Це настільки потрібна важлива і потрібна інформація, яку постійно потрібно для себе вдосконалювати.',
  },
  {
    category: 'Матриця Долі',
    feedback:
      'Широ рекомендую пані Юлію! Якщо у вас в голові каламбур, і ви не знаєте, що робити далі чи за що братися - то вам точно неї! Вона розставить усі ваші думки по поличках і дасть круті рекомендації! Особисто у мене був запит про фінанси, так от, пані Юлія описала все на 99.9% точно і розповіла, як дійти до своєї цілі! Це нереально, але це факт! Як скептик, була дійсно здивована! Тому щиро рекомендую! А для вас пані Юлія, бажаю багато вдячних клієнтів! Ви крута! І точно правильно обрали свій шлях наставництва!',
  },
  {
    category: 'Матриця Долі',
    feedback:
      'Я в захваті!🙂 Настільки все зрозуміло розписано, я задоволена. Дуже багато корисної інформації, яка мене мотивувала і дала розуміння куди рухатись далі і що пропрацювати.',
  },
  {
    category: 'Матриця Долі',
    feedback:
      'Если честно, я заряжаюсь такими разговорами, я могла бы еще часа два разговаривать, разбор дал мне пищу для размышления и это то чего мне не хватало! Ну и конечно - с вами как с человеком было приятно общаться. Благодарна вам!',
  },
  {
    category: 'Цвяхотерапія',
    feedback:
      'Хотіла щиро подякувати! Я ще не до кінця прийшла до тями, але відчуваю, що щось змінилось в мені і я розумію, що як раніше вже ніколи не буде. Я рада, що ти відкрила мені очі на деякі речі і тільки зараз мені приходять ті думки, які я не приймала коли стояла, бо чесно було важко і дуже боляче, але зараз я розумію чому. Дякую!',
  },
  {
    category: 'Цвяхотерапія',
    feedback:
      'Для меня это был огромный шаг в работе над собой и действительно сейчас я вижу больше возможностей и совершенно по-другому смотрю на проблемы',
  },
  {
    category: 'Цвяхотерапія',
    feedback:
      'Добрий вечір. Дякую за чудову терапію! Я досі не можу повірити, що я стала на цвяхи. Затиснуті місця почали боліти коли їхала вже в потязі. Це нереально круті відчуття! Ще ніколи в житті не була настільки розслаблена, більше починаю говорити те, що думаю і більш спокійно відноситись до всього.',
  },
];

export const Feedbacks = () => {
  return (
    <section id="feedback" className="flex flex-col gap-y-8 overflow-x-hidden">
      <Title>Результати клієнтів</Title>
      <FeedbackVideo />
      <FeedbackSlider data={data} />
    </section>
  );
};
